# 필요라이브러리

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## pandas 자료구조

In [6]:
# 시리즈(series) : Numpy의 1차원 배열과 유사하다
## 시리즈 = 인덱스(index) + 값(value)
obj = pd.Series([1, 2, 3, 4, 5])
x = np.array([1, 2, 3, 4, 5])

In [7]:
x
# 값만 가지고 있음

array([1, 2, 3, 4, 5])

In [8]:
obj
# 인덱스를 가지고 있음

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# 시리즈 생성
s = pd.Series([9904312, 3448737, 2890451, 2466052],
             index = ['서울', '대전', '대구', '부산'])
s
# 값에 인덱스를 지정해줄수있음

서울    9904312
대전    3448737
대구    2890451
부산    2466052
dtype: int64

In [10]:
s.index
# 인덱스만

Index(['서울', '대전', '대구', '부산'], dtype='object')

In [11]:
s.values
# 밸류(값)만
# 1차원배열과 유사하다

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [12]:
s

서울    9904312
대전    3448737
대구    2890451
부산    2466052
dtype: int64

In [13]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [14]:
s / 1000000

도시
서울    9.904312
대전    3.448737
대구    2.890451
부산    2.466052
Name: 인구, dtype: float64

In [15]:
s[1]
# 인덱스로 대전의 값만 추출. 인덱싱

3448737

In [16]:
s['대전']
# 인덱스 라벨로 추출

3448737

In [17]:
s[[0, 3, 1]]
# 하나 이상의 값을 쓸 때 파이썬 기반이라 리스트를 이용한다
# 원하는 순서대로 보여주기

도시
서울    9904312
부산    2466052
대전    3448737
Name: 인구, dtype: int64

In [18]:
s[['부산','서울','대전']]
# 인덱스 라벨로도 가능

도시
부산    2466052
서울    9904312
대전    3448737
Name: 인구, dtype: int64

In [19]:
# 인구가 250만 초과, 500만 미만인 경우 추출
# 조건을 통해서 원하는 데이터에 접근 가능

In [20]:
s[(s > 2500000) & (s < 5000000)]

도시
대전    3448737
대구    2890451
Name: 인구, dtype: int64

In [21]:
s[1:3]

도시
대전    3448737
대구    2890451
Name: 인구, dtype: int64

In [22]:
s

도시
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [23]:
s['대전':'부산']

도시
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [24]:
s0 = pd.Series(range(3), index = ['a','b','c'])

In [25]:
s0[0]

0

In [26]:
s0['a']

0

In [27]:
s0.a
# 다이렉트 연산자를 사용해서 접근할수도 있다

0

In [28]:
'서울' in s
# in : 포함하냐

True

In [29]:
'인천' in s

False

In [30]:
# 사전.keys()
# 사전.values()
# 사전.items()

In [31]:
# items가 불러주는 값을 k(key)와 v(value)로 분리하겟다는.. 언패킹
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
대전 = 3448737
대구 = 2890451
부산 = 2466052

In [32]:
# 시리즈는 딕셔너리와 비슷하다
s2 = pd.Series({'서울':9631482, '부산':3393191,
                '인천':2632035,'대전':1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [33]:
# 순서를 부여하고 싶다면 인덱스를 이용 가능
# 순서를 바꾸거나.. 응용 가능
s2 = pd.Series({'서울':9631482, '부산':3393191,
                '인천':2632035,'대전':1490158},
              index = ['부산','대전','인천','서울'])
s2

부산    3393191
대전    1490158
인천    2632035
서울    9631482
dtype: int64

In [34]:
# 파이썬의 dict
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [35]:
# 파이썬의 list
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [36]:
# isnull(), notnull()
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [38]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
obj3 + obj4
# 유타와 캘리포니아는 더하고자하는 한쪽이 NaN이므로 계산불가

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

## Data Frame(데이터프레임)
- 표 형태로 구현된 자료구조
- 2차원 행렬 + 인덱스
- row index, column index (행렬 각각 붙어서 2개)

In [41]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

columns = ['지역', '2015','2010','2005','2000','2010-2015 증가율']
index = ['서울','부산','인천','대구']

df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [42]:
df.head()

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [43]:
df.info()
# R의 str같은거
# 쌤이 제일 좋아하는거래

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010-2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 224.0+ bytes

In [44]:
df.describe()
# R의 summary와 같음

               2015          2010          2005          2000  2010-2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.522120e+06  4.562197e+06  4.612434e+06       0.039225
std    3.507776e+06  3.431328e+06  3.500545e+06  3.538749e+06       0.039809
min    2.466052e+06  2.431774e+06  2.456016e+06  2.466338e+06       0.014100
25%    2.784351e+06  2.581970e+06  2.502264e+06  2.472077e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06       0.098200

In [45]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [46]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [47]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [48]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [49]:
df.columns.name = '특성'
df.index.name = '도시'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [50]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [51]:
df = df.drop('2010-2015 증가율', axis=1)
# 축 옵션 필수

In [52]:
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [53]:
# '2005-2010 증가율'이라는 이름의 열 추가
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [54]:
# 열삭제 - 바로 원본에 반영됨
del df['2005-2010 증가율']
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [55]:
df['지역']
# 시리즈

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [56]:
# 자료형 확인 type
type(df['지역'])

pandas.core.series.Series

In [57]:
df[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [58]:
df[['지역']]
# [[]]쓰면 데이터프레임이 유지됨

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [59]:
# 자료형 확인 type
type(df[['지역']])

pandas.core.frame.DataFrame

#### loc와 iloc를 이용한 인덱스와 슬라이싱

In [60]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [61]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [62]:
# 열 인덱스
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [63]:
# 행 인덱스
frame.index

RangeIndex(start=0, stop=6, step=1)

In [64]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
frame2
# debt컬럼은 값이 없으니 NaN으로 출력됨
# one two three... 라벨링이 자동으로 돼있음
# 숫자라벨링은 혼동가능성 때문에 추천하지 않는다

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [65]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [66]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [67]:
frame2['three']
# 이 표현은 컴퓨터가 이해하기 어렵다
# 컬럼인지 행인지 알 수 없으니
# 행일때는 규칙을 주자

KeyError: 'three'

In [68]:
frame2[2]

KeyError: 2

In [69]:
frame2.loc['three']
# 라벨링된걸 읽어올떄는 loc

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [70]:
frame2.iloc[2]
# 숫자인덱스로 된걸 읽어올떄는 iloc

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [ ]:
# debt 채워보기
# 1. 일괄적으로 같은값채우기
# 2. 다 다른값 채우기

In [71]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [72]:
frame2['debt'] = np.arange(6.)
# 마지막 값 : 6
# . 찍었으니 실수값 채움
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [73]:
# 데이터프레임을 값을 담을 때는 반드시 그 크기가 같아야 한다
# 그렇지않으면 NaN(missing value, 결측값)이 생성된다
val = pd.Series([-1.2, -1.5, -1.7],
               index = ['two','four','five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [75]:
# 데이터프레임은 여러개의 시리즈객체가 결합된 형태다
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [76]:
# 파생변수 : 기존의 값을 이용해서 새로운 컬럼을 추가
frame2['eastern'] = frame2.state == 'Ohio'
frame2
# 파이썬 기반일때는 반복문을 쓰지않고도 처리가능

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [77]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [78]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [79]:
pd.DataFrame(pop, index = [2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [80]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN